<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"test-plan colours","backend":"c002fbf8756e27f99287360dc2f081e8ce51723864a2a720a657a13f48fbc472","plan_job_ref":"Job Test terraform-plan #784 at https://github.com/dflook/terraform-github-actions/actions/runs/16830246778","plan_out_hash":"79d2c80a9aee0e0adfb670c4a38ba5626f9d545ddced984d3d16e229122284f7","plan_hash":"634761320ac9fac765536d42aad9071366ef54b4d225b61b940463555913ffd3","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-plan colours__
<details>
<summary>Plan: 3 to add, 1 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.update will be updated in-place
!~  resource "aws_s3_object" "update" {
!~      content                = "hello" -> "update"
        id                     = "test-plan-colours-test-object"
        tags                   = {}
+       version_id             = (known after apply)
#        (12 unchanged attributes hidden)
    }

  # random_string.add[0] will be created
+   resource "random_string" "add" {
+       id          = (known after apply)
+       length      = 3
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = true
+       upper       = true
    }

  # random_string.create_before_delete must be replaced
+/- resource "random_string" "create_before_delete" {
!~      id          = "****" -> (known after apply)
!~      length      = 4 -> 3 # forces replacement
!~      result      = "****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.delete[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "random_string" "delete" {
-       id          = "02g" -> null
-       length      = 3 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = "02g" -> null
-       special     = true -> null
-       upper       = true -> null
    }

  # random_string.delete_before_create must be replaced
-/+ resource "random_string" "delete_before_create" {
!~      id          = "***" -> (known after apply)
!~      length      = 3 -> 4 # forces replacement
!~      result      = "***" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
+   add    = "hello"
-   delete = "goodbye" -> null
!~  update = "hello" -> "update"
```
</details>

:memo: Plan generated in [Test terraform-plan #784](https://github.com/dflook/terraform-github-actions/actions/runs/16830246778)